handlers/discount-api/test/fixtures/supporter-plus/student.json

{
  "success": true,
  "id": "71a1bfb50a3990ed7a491a4afe4c4640",
  "accountId": "8ad0975e990ed7c201991a4afd656c8e",
  "accountNumber": "A01039978",
  "accountName": "001UD00000MXyVPYA1",
  "invoiceOwnerAccountId": "8ad0975e990ed7c201991a4afd656c8e",
  "invoiceOwnerAccountNumber": "A01039978",
  "invoiceOwnerAccountName": "001UD00000MXyVPYA1",
  "subscriptionNumber": "A-S01021694",
  "version": 1,
  "revision": "1.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2025-09-05",
  "serviceActivationDate": "2025-09-05",
  "customerAcceptanceDate": "2025-09-05",
  "subscriptionStartDate": "2025-09-05",
  "subscriptionEndDate": "2026-09-05",
  "lastBookingDate": "2025-09-05",
  "termStartDate": "2025-09-05",
  "termEndDate": "2026-09-05",
  "initialTerm": 365,
  "initialTermPeriodType": "Day",
  "currentTerm": 365,
  "currentTermPeriodType": "Day",
  "autoRenew": false,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 0,
  "totalContractedValue": 9,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "AcquisitionMetadata__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "LastQSSPaymentDate__c": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "LastPlanAddedDate__c": null,
  "dummy__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": {
    "id": "8ad0975e990ed7c201991a4afd6e6c8f",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "test",
    "lastName": "user",
    "nickname": null,
    "workEmail": "testing@guardian.co.uk",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad0975e990ed7c201991a4afd656c8e",
    "accountNumber": "A01039978",
    "isSpecifiedInSubscription": false
  },
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "id": "8ad0975e990ed7c201991a4afd8e6c91",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "test",
    "lastName": "user",
    "nickname": null,
    "workEmail": "testing@guardian.co.uk",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad0975e990ed7c201991a4afd656c8e",
    "accountNumber": "A01039978",
    "isSpecifiedInSubscription": false
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "71a1bfb50a3990ed7a491a4afed34648",
      "productId": "8ad09fc281de1ce70181de3b23b2363d",
      "productName": "Supporter Plus",
      "productSku": "SKU-00000072",
      "productRatePlanId": "71a10c6269b981784c9817e1887c0000",
      "productRatePlanNumber": null,
      "ratePlanName": "Supporter Plus - One Year Student",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01754326",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "71a1bfb50a3990ed7a491a4afe4c4641",
          "originalChargeId": "71a1bfb50a3990ed7a491a4afe4c4641",
          "productRatePlanChargeId": "71a10c6269b981784c9817e188d60001",
          "number": "C-01782317",
          "name": "Subscription",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-09-05",
          "effectiveEndDate": "2026-09-05",
          "processedThroughDate": "2025-09-05",
          "chargedThroughDate": "2026-09-05",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 0.75,
          "dmrc": 0.75,
          "tcv": 9,
          "dtcv": 9,
          "originalOrderDate": "2025-09-05",
          "amendedByOrderOn": null,
          "description": null,
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 9,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP9",
          "price": 9,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-01067131",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2025-09-05",
      "endDate": "2026-09-05",
      "status": "Active"
    },
    {
      "startDate": "2026-09-05",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-09-05 15:32:26",
  "updateTime": "2025-09-05 15:32:26",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}